Roof cannot be joined to more than one reference plane.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RoofToRefPlanesError { get; }
  Visual Basic
Public Shared ReadOnly Property RoofToRefPlanesError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RoofToRefPlanesError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoofFailures Class
  Autodesk.Revit.DB Namespace